---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyMembersReferToOutsideFamily
source: html/42bc8f99-04cf-4f40-96fb-dce3a7f26039.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyMembersReferToOutsideFamily Property

Memebrs of Family '[Name]' or a nested family thereof illegally refer to Elements outside the family.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyMembersReferToOutsideFamily { get; }
```